Delans-TLE/src/InformationRegisters/ES_КоординатыКурьеров/ES_КоординатыКурьеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ES_КоординатыКурьеров</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Долгота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Широта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяПровайдера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Узел</name>
    <type>
      <types>ExchangePlanRef.EFSOL_МобильноеПриложение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Delans-TLE/src/WebServices/EFSOL_MS/Module.bsl
//Процедура ПроверитьПраваПользователя(Пользователь = Неопределено)
//	
//	Если Пользователь = Неопределено Тогда
//		Пользователь = Пользователи.АвторизованныйПользователь();
//	КонецЕсли;
//	
//	Если НЕ РольДоступна(Метаданные.Роли.ПолныеПрава)
//	   И НЕ(РольДоступна(Метаданные.Роли.ДобавлениеИзменениеПодсистемыПродажи) // Профиль Базовые права.
//		  И РольДоступна(Метаданные.Роли.ДобавлениеИзменениеПодсистемыКасса)
//		  И РольДоступна(Метаданные.Роли.ДобавлениеИзменениеПодсистемыБанк)) Тогда // Профиль Деньги.
//		
//		ВызватьИсключение(
//			НСтр("ru='У пользователя ""'")
//		  + Пользователь
//		  + НСтр("ru='"" нет прав на синхронизацию данных с мобильным приложением 1С:Управление небольшой фирмой. Необходимо включить профили прав доступа Базовые права и Деньги.'")
//		);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

// Операция получения данных
// получает пакет изменений предназначенных для данного узла
//
// Параметры:
//  КодМобильногоКомпьютера	– код узла, с которым идет обмен
//
// Возвращаемое значение:
//  ХранилищеЗначения, в которое помещен пакет обмена
//
Функция ПолучитьДанные(КодМобильногоКомпьютера, ИмяМобильногоКомпьютера, ПользовательМобильногоУстройства)
	
	//ЗаписьЖурналаРегистрации("Подключение",,,,"Я здесь",);
	
	УстановитьПривилегированныйРежим(Истина);
	
	УзелОбмена = ПланыОбмена.EFSOL_МобильноеПриложение.НайтиПоКоду(КодМобильногоКомпьютера);
	
	Если УзелОбмена.Пустая() Тогда
		Возврат Новый ХранилищеЗначения("Узел с кодом " + КодМобильногоКомпьютера + " не обнаружен в основной базе", Новый СжатиеДанных(9));
	КонецЕсли;
		
	Возврат EFSOL_ОбменМобильноеПриложениеОбщее.СформироватьПакетОбмена(УзелОбмена, КодМобильногоКомпьютера);
	
КонецФункции

// Операция записи данных
// записывает пакет изменений принятых от данного узла
//
// Параметры:
//  КодМобильногоКомпьютера	– код узла, с которым идет обмен
//  ДанныеМобильногоПриложения - ХранилищеЗначения, в которое помещен пакет обмена
//
// Возвращаемое значение:
//  нет
//
Функция ЗаписатьДанные(КодМобильногоКомпьютера, ДанныеМобильногоПриложения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	УзелОбмена = ПланыОбмена.EFSOL_МобильноеПриложение.НайтиПоКоду(КодМобильногоКомпьютера); 
	
	Если УзелОбмена.Пустая() Тогда
		Возврат Новый ХранилищеЗначения("Узел с кодом " + КодМобильногоКомпьютера + " не обнаружен в основной базе", Новый СжатиеДанных(9));
	КонецЕсли;
	
	EFSOL_ОбменМобильноеПриложениеОбщее.ПринятьПакетОбмена(УзелОбмена, ДанныеМобильногоПриложения, Истина);
	
КонецФункции

// Операция создания Android-узла обмена
// создает узел (если его еще нет в базе) для определенного курьера
//
// Параметры:
//  Курьер	– курьер, для которого необходимо создать узел
//
// Возвращаемое значение:
//  Строка в формате "Код;Наименование" нового узла.
Функция СоздатьУзелКурьера(Курьер)
	НовыйУзел = ПланыОбмена.EFSOL_МобильноеПриложение.СоздатьУзел();
	
	НовыйУзел.УстановитьНовыйКод();
	НовыйУзел.Наименование = Курьер;
	НовыйУзел.НомерОтправленного = 0;
	НовыйУзел.НомерПринятого = 0;
	НовыйУзел.Записать();
	
	СтруктураКодНаименование = Новый Структура("Код, Наименование", НовыйУзел.Код, НовыйУзел.Наименование);
	Возврат Новый ХранилищеЗначения(СтруктураКодНаименование, Новый СжатиеДанных(9));
	
КонецФункции


Функция ПолучитьЦентральныйУзел()
	ЦентральныйУзел = ПланыОбмена.EFSOL_МобильноеПриложение.ЭтотУзел().ПолучитьОбъект();
	Если Не ЗначениеЗаполнено(ЦентральныйУзел.Код) Тогда
		ЦентральныйУзел.ОбменДанными.Загрузка = Истина;
		ЦентральныйУзел.Код 			= "000000001";
		ЦентральныйУзел.Наименование 	= "ЦентральныйУзел";
		ЦентральныйУзел.Записать();	
	КонецЕсли;
	
	СтруктураКодНаименование = Новый Структура("Код, Наименование", ЦентральныйУзел.Код, ЦентральныйУзел.Наименование);
	Возврат Новый ХранилищеЗначения(СтруктураКодНаименование, Новый СжатиеДанных(9));
КонецФункции


Функция ПолучитьКоличествоУзловВЦБ()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ EFSOL_МобильноеПриложение.Ссылка) КАК Количество
	               |ИЗ
	               |	ПланОбмена.EFSOL_МобильноеПриложение КАК EFSOL_МобильноеПриложение
	               |ГДЕ
	               |	EFSOL_МобильноеПриложение.ЭтотУзел <> ИСТИНА
	               |	И EFSOL_МобильноеПриложение.ПометкаУдаления = ЛОЖЬ";
    Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат 0;	
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Количество;
КонецФункции


Функция ЗаписатьКоординаты(Узел, Долгота, Широта, ИмяПровайдера)
	
	УзелСсылка = ПланыОбмена.EFSOL_МобильноеПриложение.НайтиПоКоду(Узел);
	
	Если УзелСсылка.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ES_КоординатыКурьеров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Узел.Установить(УзелСсылка);
	НаборЗаписей.Отбор.Курьер.Установить(УзелСсылка.Пользователь);
	НаборЗаписей.Прочитать();
	
	НоваяЗапись = НаборЗаписей.Добавить();
	
	НоваяЗапись.Период 	= ТекущаяДата();
	НоваяЗапись.Узел	= УзелСсылка;
	НоваяЗапись.Курьер	= УзелСсылка.Пользователь;
	НоваяЗапись.Долгота = Долгота;
	НоваяЗапись.Широта 	= Широта;
	НоваяЗапись.ИмяПровайдера = ИмяПровайдера;
	НаборЗаписей.Записать(Истина);
	
	Возврат Истина;
	
КонецФункции
